Revit 2027 API
BuiltInFailures.RebarSystemFailures.RebarSystemOffset Property
 Rebar Cover Side/Edge is too large for sketch. Bar placement may be inaccurate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarSystemOffset { get; }
Public Shared ReadOnly Property RebarSystemOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarSystemOffset {
	FailureDefinitionId^ get ();
}
static member RebarSystemOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace